# Створення зворотнього таймера у Python?


# імпортуємо потрібну бібліотеку для роботи з часом
import time

# просимо користувача ввести скільки секунд працюватиме таймер
seconds = int(input("Введіть час таймера в секундах: "))

print(f"Таймер запущено на {seconds} секунд ")

# цикл, який відраховує час
for i in range(seconds, 0, -1):
    print(f"Залишилось {i} секунд...", end="\r")  # виводимо на одному рядку
    time.sleep(1)  # пауза 1 секунда

# після завершення таймера
print("\nЧас вийшов!")











# Домашнє завдання:

# Зробіть таймер з хвилинами, а не секундами.

# Додайте звук (через winsound на Windows або os.system('say ...') на Mac).

# Спробуйте, щоб таймер виводив прогрес у відсотках.