# як робити копію списку Python?


old_list = [1, 2, 3, 4]
new_list = old_list[:]  # новий список, копія старого
print("Original:", old_list)
print("Copy:", new_list)


# -------------------------------
#  Форматований друк словників
# -------------------------------
# красивий друк словника JSON

import json
obj = {'name': 'Oleg', 'age': 25, 'skills': ['Python', 'Flask', 'Docker']}
print(json.dumps(obj, indent=2))


# Копія списку — безпечна робота з даними, не змінюючи оригінал.

# Красивий JSON — зручна візуалізація, логування та перевірка структурованих даних. 