# Знайти email в тексті на Python?



import re

text = "Привіт! Мій email: olya123@gmail.com. Напиши мені!"
pattern_email = r"[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}"
emails = re.findall(pattern_email, text)
print(" Знайдено email:", emails)

# Оцей шаблон шукає email.
# Перша частина — це імʼя пошти: літери, цифри, крапки й інші символи.
# Потім шукаємо знак @.
# Далі — домен: літери, цифри, крапки або дефіс.
# Потім обовʼязкова крапка.
# І в кінці — закінчення домену, наприклад com або ua


#  re.findall() шукає всі збіги шаблону у тексті
# r"" — це "raw string", щоб не екранувати спецсимволи


# Домашка
# Візьми будь-який текст, наприклад: повідомлення в чаті
# Спробуй знайти:
# всі email
# всі числа
# всі слова, що починаються з великої літери
# Поділися своїм кодом та результатами у коментарях