
# Як виміряти час виконання коду в Python?



import time

start1 = time.time()  # фіксуємо час початку
# приклад коду для вимірювання
numbers = [x**2 for x in range(1_000_000)]
end1 = time.time()    # фіксуємо час кінця



start = time.time()  # фіксуємо час початку
numbers = list(range(1, 1_000_001))
test = sum(numbers)
end = time.time()    # фіксуємо час кінця


print(f"Час виконання: {end1 - start1:.3f} секунд")
print(f"Час виконання: {end - start:.3f} секунд")



# Домашнє завдання:

# Напишіть свій код (наприклад, створення списку, обчислення факторіалу або сумування чисел).

# Виміряйте час його виконання за допомогою time.

# У коментарях напишіть: “Мій код виконався за __ секунд.”




































