# -------------------------------
#  try/except — ловим помилку красиво
# -------------------------------



# try:
#     number = int(input("Введи число: "))
#     print("Вдалося:", number)
# except ValueError:
#     print("Помилка: введи саме число!")
# Коментар: якщо користувач вводить щось не те — програма не ламається.



# -------------------------------
#  Використовуємо else та finally
# -------------------------------

try:
    file = open("config1.txt")
except FileNotFoundError:
    print("Файл не знайдено!")
else:
    print("Файл успішно відкрито!")
finally:
    print("Перевірка завершена.")
# Коментар:
# else — виконується тільки якщо помилок немає.
# finally — виконується завжди, хоч з помилкою, хоч без.


