# Як сортувати дані на Python просто?


# --- Сортуємо список рядків за довжиною ---
words = ["кіт", "песик", "а", "будинок"]

print(sorted(words, key=len))
# : key=len — каже Python сортувати за довжиною слова

print("---")

# --- Сортуємо список словників за віком ---
users = [
    {"name": "Оля", "age": 25},
    {"name": "Іван", "age": 19},
    {"name": "Марта", "age": 30}
]

print(sorted(users, key=lambda u: u["age"]))
# : key=lambda ... — забираємо поле "age" для сортування


# Домашка
# Створи список продуктів із полем "price" і відсортуй у два способи:
# за ціною
# за довжиною назви
# Залиш результат у коментарях.