# Чому is — це не == в Python ?



a = [1, 2, 3]
b = [1, 2, 3]

print(a == b)  # True
print(a is b)  # False

# x = 256
# y = 256

x = int("256")
y = int("256")

print(x == y)  # True
print(x is y)  # True (але не завжди!)


# Діапазон -5..256 - дівпазон кешованих чисел в Python автоматично

# == → порівнює значення

# is → перевіряє, чи це один і той самий обʼєкт у памʼяті

# is НЕ для порівняння чисел і рядків

# is використовується для:
# if value is None:
#     ...


# помилка
# if status is 1:   # неправильно

# correct
# if status == 1:  # правильно
#     pass




# дз
# Створи два однакових списки

# Перевір == і is

# Зроби так, щоб is повертав True

# Поясни чому